IDEA StatiCa Open Model
Segment3D.EndPoint Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 Gets or sets the reference to Point3D endpoint of the segment.
 Namespace: IdeaRS.OpenModel.Geometry3D
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public ReferenceElement EndPoint { get; set; }
Public Property EndPoint As ReferenceElement
	Get
	Set
public:
property ReferenceElement^ EndPoint {
	ReferenceElement^ get ();
	void set (ReferenceElement^ value);
}
Property Value
Type: ReferenceElement
See Also
Reference
Segment3D Class
IdeaRS.OpenModel.Geometry3D Namespace